zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K39_BCTU.h
#define BCTU_MSR_LIST2_Last_MASK                 (0x400U)
#define BCTU_MSR_LIST2_Last_SHIFT                (10U)
#define BCTU_MSR_LIST2_Last_WIDTH                (1U)
#define BCTU_MSR_LIST2_Last(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST2_Last_SHIFT)) & BCTU_MSR_LIST2_Last_MASK)

#define BCTU_MSR_LIST3_Last_MASK                 (0x800U)
#define BCTU_MSR_LIST3_Last_SHIFT                (11U)
#define BCTU_MSR_LIST3_Last_WIDTH                (1U)
#define BCTU_MSR_LIST3_Last(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST3_Last_SHIFT)) & BCTU_MSR_LIST3_Last_MASK)

#define BCTU_MSR_TRGF_MASK                       (0x8000U)
#define BCTU_MSR_TRGF_SHIFT                      (15U)
#define BCTU_MSR_TRGF_WIDTH                      (1U)
#define BCTU_MSR_TRGF(x)                         (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_TRGF_SHIFT)) & BCTU_MSR_TRGF_MASK)

#define BCTU_MSR_NDATA0_CLR_MASK                 (0x10000U)
#define BCTU_MSR_NDATA0_CLR_SHIFT                (16U)
#define BCTU_MSR_NDATA0_CLR_WIDTH                (1U)
#define BCTU_MSR_NDATA0_CLR(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_NDATA0_CLR_SHIFT)) & BCTU_MSR_NDATA0_CLR_MASK)

#define BCTU_MSR_NDATA1_CLR_MASK                 (0x20000U)
#define BCTU_MSR_NDATA1_CLR_SHIFT                (17U)
#define BCTU_MSR_NDATA1_CLR_WIDTH                (1U)
#define BCTU_MSR_NDATA1_CLR(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_NDATA1_CLR_SHIFT)) & BCTU_MSR_NDATA1_CLR_MASK)

#define BCTU_MSR_NDATA2_CLR_MASK                 (0x40000U)
#define BCTU_MSR_NDATA2_CLR_SHIFT                (18U)
#define BCTU_MSR_NDATA2_CLR_WIDTH                (1U)
#define BCTU_MSR_NDATA2_CLR(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_NDATA2_CLR_SHIFT)) & BCTU_MSR_NDATA2_CLR_MASK)

#define BCTU_MSR_NDATA3_CLR_MASK                 (0x80000U)
#define BCTU_MSR_NDATA3_CLR_SHIFT                (19U)
#define BCTU_MSR_NDATA3_CLR_WIDTH                (1U)
#define BCTU_MSR_NDATA3_CLR(x)                   (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_NDATA3_CLR_SHIFT)) & BCTU_MSR_NDATA3_CLR_MASK)

#define BCTU_MSR_DATAOVR0_CLR_MASK               (0x100000U)
#define BCTU_MSR_DATAOVR0_CLR_SHIFT              (20U)
#define BCTU_MSR_DATAOVR0_CLR_WIDTH              (1U)
#define BCTU_MSR_DATAOVR0_CLR(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_DATAOVR0_CLR_SHIFT)) & BCTU_MSR_DATAOVR0_CLR_MASK)

#define BCTU_MSR_DATAOVR1_CLR_MASK               (0x200000U)
#define BCTU_MSR_DATAOVR1_CLR_SHIFT              (21U)
#define BCTU_MSR_DATAOVR1_CLR_WIDTH              (1U)
#define BCTU_MSR_DATAOVR1_CLR(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_DATAOVR1_CLR_SHIFT)) & BCTU_MSR_DATAOVR1_CLR_MASK)

#define BCTU_MSR_DATAOVR2_CLR_MASK               (0x400000U)
#define BCTU_MSR_DATAOVR2_CLR_SHIFT              (22U)
#define BCTU_MSR_DATAOVR2_CLR_WIDTH              (1U)
#define BCTU_MSR_DATAOVR2_CLR(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_DATAOVR2_CLR_SHIFT)) & BCTU_MSR_DATAOVR2_CLR_MASK)

#define BCTU_MSR_DATAOVR3_CLR_MASK               (0x800000U)
#define BCTU_MSR_DATAOVR3_CLR_SHIFT              (23U)
#define BCTU_MSR_DATAOVR3_CLR_WIDTH              (1U)
#define BCTU_MSR_DATAOVR3_CLR(x)                 (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_DATAOVR3_CLR_SHIFT)) & BCTU_MSR_DATAOVR3_CLR_MASK)

#define BCTU_MSR_LIST0_Last_CLR_MASK             (0x1000000U)
#define BCTU_MSR_LIST0_Last_CLR_SHIFT            (24U)
#define BCTU_MSR_LIST0_Last_CLR_WIDTH            (1U)
#define BCTU_MSR_LIST0_Last_CLR(x)               (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST0_Last_CLR_SHIFT)) & BCTU_MSR_LIST0_Last_CLR_MASK)

#define BCTU_MSR_LIST1_Last_CLR_MASK             (0x2000000U)
#define BCTU_MSR_LIST1_Last_CLR_SHIFT            (25U)
#define BCTU_MSR_LIST1_Last_CLR_WIDTH            (1U)
#define BCTU_MSR_LIST1_Last_CLR(x)               (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST1_Last_CLR_SHIFT)) & BCTU_MSR_LIST1_Last_CLR_MASK)

#define BCTU_MSR_LIST2_Last_CLR_MASK             (0x4000000U)
#define BCTU_MSR_LIST2_Last_CLR_SHIFT            (26U)
#define BCTU_MSR_LIST2_Last_CLR_WIDTH            (1U)
#define BCTU_MSR_LIST2_Last_CLR(x)               (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST2_Last_CLR_SHIFT)) & BCTU_MSR_LIST2_Last_CLR_MASK)

#define BCTU_MSR_LIST3_Last_CLR_MASK             (0x8000000U)
#define BCTU_MSR_LIST3_Last_CLR_SHIFT            (27U)
#define BCTU_MSR_LIST3_Last_CLR_WIDTH            (1U)
#define BCTU_MSR_LIST3_Last_CLR(x)               (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_LIST3_Last_CLR_SHIFT)) & BCTU_MSR_LIST3_Last_CLR_MASK)

#define BCTU_MSR_TRGF_CLR_MASK                   (0x80000000U)
#define BCTU_MSR_TRGF_CLR_SHIFT                  (31U)
#define BCTU_MSR_TRGF_CLR_WIDTH                  (1U)
#define BCTU_MSR_TRGF_CLR(x)                     (((uint32_t)(((uint32_t)(x)) << BCTU_MSR_TRGF_CLR_SHIFT)) & BCTU_MSR_TRGF_CLR_MASK)
/*! @} */

/*! @name TRGCFG - Trigger Configuration */
/*! @{ */

#define BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR_MASK  (0x7FU)
#define BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR_SHIFT (0U)
#define BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR_WIDTH (7U)
#define BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR(x)    (((uint32_t)(((uint32_t)(x)) << BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR_SHIFT)) & BCTU_TRGCFG_CHANNEL_VALUE_OR_LADDR_MASK)

#define BCTU_TRGCFG_ADC_SEL0_MASK                (0x100U)
#define BCTU_TRGCFG_ADC_SEL0_SHIFT               (8U)
#define BCTU_TRGCFG_ADC_SEL0_WIDTH               (1U)
#define BCTU_TRGCFG_ADC_SEL0(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_TRGCFG_ADC_SEL0_SHIFT)) & BCTU_TRGCFG_ADC_SEL0_MASK)

#define BCTU_TRGCFG_ADC_SEL1_MASK                (0x200U)
#define BCTU_TRGCFG_ADC_SEL1_SHIFT               (9U)
#define BCTU_TRGCFG_ADC_SEL1_WIDTH               (1U)
#define BCTU_TRGCFG_ADC_SEL1(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_TRGCFG_ADC_SEL1_SHIFT)) & BCTU_TRGCFG_ADC_SEL1_MASK)

#define BCTU_TRGCFG_ADC_SEL2_MASK                (0x400U)
#define BCTU_TRGCFG_ADC_SEL2_SHIFT               (10U)
#define BCTU_TRGCFG_ADC_SEL2_WIDTH               (1U)
#define BCTU_TRGCFG_ADC_SEL2(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_TRGCFG_ADC_SEL2_SHIFT)) & BCTU_TRGCFG_ADC_SEL2_MASK)

#define BCTU_TRGCFG_ADC_SEL3_MASK                (0x800U)
#define BCTU_TRGCFG_ADC_SEL3_SHIFT               (11U)
#define BCTU_TRGCFG_ADC_SEL3_WIDTH               (1U)
#define BCTU_TRGCFG_ADC_SEL3(x)                  (((uint32_t)(((uint32_t)(x)) << BCTU_TRGCFG_ADC_SEL3_SHIFT)) & BCTU_TRGCFG_ADC_SEL3_MASK)

